src/test/resources/bodies/apiTest/soap/bodyRefinance.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="urn://bancodebogota.com/creditcard/product/service/" xmlns:even="urn://bancodebogota.com/creditcard/product/event/" xmlns:v1="urn://bancodebogota.com/ifx/base/v1/" xmlns:v11="urn://bancodebogota.com/customers/classification/v1/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:modAcctRefinanceRequest>
            <even:AcctRefinanceModRq>
                <v1:RqUID>a9f85040-2b26-40a1-bcd4-acff0ac3ad8B</v1:RqUID>
                <v1:CustId>
                    <v1:CustLoginId>TGUZMA1</v1:CustLoginId>
                </v1:CustId>
                <v1:NetworkTrnInfo>
                    <v1:NetworkOwner>${canal}</v1:NetworkOwner>
                    <v1:TerminalId>10.87.160.27</v1:TerminalId>
                </v1:NetworkTrnInfo>
                <v1:ClientDt>2025-08-27T10:21:00</v1:ClientDt>
                <v1:OrgClient>
                    <v1:ParticipantId>801</v1:ParticipantId>
                </v1:OrgClient>
                <v1:CardAcctId>
                    <v1:ProductId>${productId}</v1:ProductId>
                    <v1:CardId>${cardId}</v1:CardId>
                </v1:CardAcctId>
                <v1:CreditInfo>
                    <v1:CreditAuthType>${creditAuthType}</v1:CreditAuthType>
                    <v1:CreditType>${creditType}</v1:CreditType>
                    <v1:CompositeCurAmt>
                        <v1:Memo>${memo}</v1:Memo>
                    </v1:CompositeCurAmt>
                    <v1:CreditId>${creditId}</v1:CreditId>
                    <v1:ClientChgCode>1</v1:ClientChgCode>
                </v1:CreditInfo>
            </even:AcctRefinanceModRq>
        </ser:modAcctRefinanceRequest>
    </soapenv:Body>
</soapenv:Envelope>